# ── Taps ─────────────────────────────────────────────────────────────────────
tap "cirruslabs/cli"    # tart VM runner

# ── CLI Utilities ────────────────────────────────────────────────────────────
brew "git"
brew "gh"               # GitHub CLI
brew "git-lfs"          # large file support
brew "vim"
brew "fzf"
brew "ripgrep"          # fast grep (rg)
brew "fd"               # fast find
brew "bat"              # better cat
brew "tmux"
brew "wget"
brew "jq"               # JSON processor
brew "tree"
brew "tart"             # Apple Silicon VM runner (local acceptance tests)

# ── Languages ────────────────────────────────────────────────────────────────
brew "go"
brew "pyenv"            # Python version manager
brew "nvm"              # Node version manager
brew "openjdk"
brew "maven"

# ── Cloud & DevOps ───────────────────────────────────────────────────────────
brew "kubernetes-cli"   # kubectl
brew "kind"             # local k8s clusters
brew "kustomize"        # Kubernetes config management
brew "helm"
brew "terraform"
brew "oci-cli"          # Oracle Cloud
brew "doctl"            # DigitalOcean CLI
brew "octant"           # Kubernetes dashboard

# ── Databases ────────────────────────────────────────────────────────────────
brew "mongosh"          # MongoDB shell
brew "postgresql@17"    # local Postgres

# ── Fonts ────────────────────────────────────────────────────────────────────
cask "font-meslo-lg-nerd-font"

# ── Python ───────────────────────────────────────────────────────────────────
brew "virtualenv"       # Python virtual environments

# ── GUI Apps ─────────────────────────────────────────────────────────────────
cask "iterm2"
cask "cursor"           # AI-first editor (works alongside Claude Code)
cask "claude-code"      # Claude Code CLI
cask "docker-desktop"
cask "mongodb-compass"
